export class RegionJson {
  data = [
    {
      name: '香港',
      city: [
        {
          name: '香港',
          area: [
            '深水埗区',
            '油尖旺区',
            '九龙城区',
            '黄大仙区',
            '观塘区',
            '北区',
            '大埔区',
            '沙田区',
            '西贡区',
            '元朗区',
            '屯门区',
            '荃湾区',
            '葵青区',
            '离岛区',
            '中西区',
            '湾仔区',
            '东区',
            '南区',
            '其他'
          ]
        }
      ]
    },
    {
      name: '天津市',
      city: [
        {
          name: '天津市',
          area: [
            '和平区',
            '河东区',
            '河西区',
            '南开区',
            '河北区',
            '红桥区',
            '塘沽区',
            '汉沽区',
            '大港区',
            '东丽区',
            '西青区',
            '津南区',
            '北辰区',
            '武清区',
            '宝坻区',
            '宁河县',
            '静海县',
            '蓟  县'
          ]
        }
      ]
    },
    {
      name: '河北省',
      city: [
        {
          name: '石家庄市',
          area: [
            '长安区',
            '桥东区',
            '桥西区',
            '新华区',
            '郊  区',
            '井陉矿区',
            '井陉县',
            '正定县',
            '栾城县',
            '行唐县',
            '灵寿县',
            '高邑县',
            '深泽县',
            '赞皇县',
            '无极县',
            '平山县',
            '元氏县',
            '赵  县',
            '辛集市',
            '藁',
            '晋州市',
            '新乐市',
            '鹿泉市'
          ]
        },
        {
          name: '唐山市',
          area: [
            '路南区',
            '路北区',
            '古冶区',
            '开平区',
            '新  区',
            '丰润县',
            '滦  县',
            '滦南县',
            '乐亭县',
            '迁西县',
            '玉田县',
            '唐海县',
            '遵化市',
            '丰南市',
            '迁安市'
          ]
        },
        {
          name: '秦皇岛市',
          area: [
            '海港区',
            '山海关区',
            '北戴河区',
            '青龙满族自治县',
            '昌黎县',
            '抚宁县',
            '卢龙县'
          ]
        },
        {
          name: '邯郸市',
          area: [
            '邯山区',
            '丛台区',
            '复兴区',
            '峰峰矿区',
            '邯郸县',
            '临漳县',
            '成安县',
            '大名县',
            '涉  县',
            '磁  县',
            '肥乡县',
            '永年县',
            '邱  县',
            '鸡泽县',
            '广平县',
            '馆陶县',
            '魏  县',
            '曲周县',
            '武安市'
          ]
        },
        {
          name: '邢台市',
          area: [
            '桥东区',
            '桥西区',
            '邢台县',
            '临城县',
            '内丘县',
            '柏乡县',
            '隆尧县',
            '任  县',
            '南和县',
            '宁晋县',
            '巨鹿县',
            '新河县',
            '广宗县',
            '平乡县',
            '威  县',
            '清河县',
            '临西县',
            '南宫市',
            '沙河市'
          ]
        },
        {
          name: '保定市',
          area: [
            '新市区',
            '北市区',
            '南市区',
            '满城县',
            '清苑县',
            '涞水县',
            '阜平县',
            '徐水县',
            '定兴县',
            '唐  县',
            '高阳县',
            '容城县',
            '涞源县',
            '望都县',
            '安新县',
            '易  县',
            '曲阳县',
            '蠡  县',
            '顺平县',
            '博野',
            '雄县',
            '涿州市',
            '定州市',
            '安国市',
            '高碑店市'
          ]
        },
        {
          name: '张家口',
          area: [
            '桥东区',
            '桥西区',
            '宣化区',
            '下花园区',
            '宣化县',
            '张北县',
            '康保县',
            '沽源县',
            '尚义县',
            '蔚  县',
            '阳原县',
            '怀安县',
            '万全县',
            '怀来县',
            '涿鹿县',
            '赤城县',
            '崇礼县'
          ]
        },
        {
          name: '承德市',
          area: [
            '双桥区',
            '双滦区',
            '鹰手营子矿区',
            '承德县',
            '兴隆县',
            '平泉县',
            '滦平县',
            '隆化县',
            '丰宁满族自治县',
            '宽城满族自治县',
            '围场满族蒙古族自治县'
          ]
        },
        {
          name: '沧州市',
          area: [
            '新华区',
            '运河区',
            '沧  县',
            '青  县',
            '东光县',
            '海兴县',
            '盐山县',
            '肃宁县',
            '南皮县',
            '吴桥县',
            '献  县',
            '孟村回族自治县',
            '泊头市',
            '任丘市',
            '黄骅市',
            '河间市'
          ]
        },
        {
          name: '廊坊市',
          area: [
            '安次区',
            '固安县',
            '永清县',
            '香河县',
            '大城县',
            '文安县',
            '大厂回族自治县',
            '霸州市',
            '三河市'
          ]
        },
        {
          name: '衡水市',
          area: [
            '桃城区',
            '枣强县',
            '武邑县',
            '武强县',
            '饶阳县',
            '安平县',
            '故城县',
            '景  县',
            '阜城县',
            '冀州市',
            '深州市'
          ]
        }
      ]
    },
    {
      name: '山西省',
      city: [
        {
          name: '太原市',
          area: [
            '小店区',
            '迎泽区',
            '杏花岭区',
            '尖草坪区',
            '万柏林区',
            '晋源区',
            '清徐县',
            '阳曲县',
            '娄烦县',
            '古交市'
          ]
        },
        {
          name: '大同市',
          area: [
            '城  区',
            '矿  区',
            '南郊区',
            '新荣区',
            '阳高县',
            '天镇县',
            '广灵县',
            '灵丘县',
            '浑源县',
            '左云县',
            '大同县'
          ]
        },
        {
          name: '阳泉市',
          area: ['城  区', '矿  区', '郊  区', '平定县', '盂  县']
        },
        {
          name: '长治市',
          area: [
            '城  区',
            '郊  区',
            '长治县',
            '襄垣县',
            '屯留县',
            '平顺县',
            '黎城县',
            '壶关县',
            '长子县',
            '武乡县',
            '沁  县',
            '沁源县',
            '潞城市'
          ]
        },
        {
          name: '晋城市',
          area: ['城  区', '沁水县', '阳城县', '陵川县', '泽州县', '高平市']
        },
        {
          name: '朔州市',
          area: ['朔城区', '平鲁区', '山阴县', '应  县', '右玉县', '怀仁县']
        },
        {
          name: '忻州市',
          area: [
            '忻府区',
            '原平市',
            '定襄县',
            '五台县',
            '代  县',
            '繁峙县',
            '宁武县',
            '静乐县',
            '神池县',
            '五寨县',
            '岢岚县',
            '河曲县',
            '保德县',
            '偏关县'
          ]
        },
        {
          name: '吕梁市',
          area: [
            '离石区',
            '孝义市',
            '汾阳市',
            '文水县',
            '交城县',
            '兴  县',
            '临  县',
            '柳林县',
            '石楼县',
            '岚  县',
            '方山县',
            '中阳县',
            '交口县'
          ]
        },
        {
          name: '晋中市',
          area: [
            '榆次市',
            '介休市',
            '榆社县',
            '左权县',
            '和顺县',
            '昔阳县',
            '寿阳县',
            '太谷县',
            '祁  县',
            '平遥县',
            '灵石县'
          ]
        },
        {
          name: '临汾市',
          area: [
            '临汾市',
            '侯马市',
            '霍州市',
            '曲沃县',
            '翼城县',
            '襄汾县',
            '洪洞县',
            '古  县',
            '安泽县',
            '浮山县',
            '吉  县',
            '乡宁县',
            '蒲  县',
            '大宁县',
            '永和县',
            '隰  县',
            '汾西县'
          ]
        },
        {
          name: '运城市',
          area: [
            '运城市',
            '永济市',
            '河津市',
            '芮城县',
            '临猗县',
            '万荣县',
            '新绛县',
            '稷山县',
            '闻喜县',
            '夏  县',
            '绛  县',
            '平陆县',
            '垣曲县'
          ]
        }
      ]
    },
    {
      name: '内蒙古',
      city: [
        {
          name: '呼和浩特市',
          area: [
            '新城区',
            '回民区',
            '玉泉区',
            '郊  区',
            '土默特左旗',
            '托克托县',
            '和林格尔县',
            '清水河县',
            '武川县'
          ]
        },
        {
          name: '包头市',
          area: [
            '东河区',
            '昆都伦区',
            '青山区',
            '石拐矿区',
            '白云矿区',
            '郊  区',
            '土默特右旗',
            '固阳县',
            '达尔罕茂明安联合旗'
          ]
        },
        {
          name: '乌海市',
          area: ['海勃湾区', '海南区', '乌达区']
        },
        {
          name: '赤峰市',
          area: [
            '红山区',
            '元宝山区',
            '松山区',
            '阿鲁科尔沁旗',
            '巴林左旗',
            '巴林右旗',
            '林西县',
            '克什克腾旗',
            '翁牛特旗',
            '喀喇沁旗',
            '宁城县',
            '敖汉旗'
          ]
        },
        {
          name: '呼伦贝尔市',
          area: [
            '海拉尔市',
            '满洲里市',
            '扎兰屯市',
            '牙克石市',
            '根河市',
            '额尔古纳市',
            '阿荣旗',
            '莫力达瓦达斡尔族自治旗',
            '鄂伦春自治旗',
            '鄂温克族自治旗',
            '新巴尔虎右旗',
            '新巴尔虎左旗',
            '陈巴尔虎旗'
          ]
        },
        {
          name: '兴安盟',
          area: [
            '乌兰浩特市',
            '阿尔山市',
            '科尔沁右翼前旗',
            '科尔沁右翼中旗',
            '扎赉特旗',
            '突泉县'
          ]
        },
        {
          name: '通辽市',
          area: [
            '科尔沁区',
            '霍林郭勒市',
            '科尔沁左翼中旗',
            '科尔沁左翼后旗',
            '开鲁县',
            '库伦旗',
            '奈曼旗',
            '扎鲁特旗'
          ]
        },
        {
          name: '锡林郭勒盟',
          area: [
            '二连浩特市',
            '锡林浩特市',
            '阿巴嘎旗',
            '苏尼特左旗',
            '苏尼特右旗',
            '东乌珠穆沁旗',
            '西乌珠穆沁旗',
            '太仆寺旗',
            '镶黄旗',
            '正镶白旗',
            '正蓝旗',
            '多伦县'
          ]
        },
        {
          name: '乌兰察布盟',
          area: [
            '集宁市',
            '丰镇市',
            '卓资县',
            '化德县',
            '商都县',
            '兴和县',
            '凉城县',
            '察哈尔右翼前旗',
            '察哈尔右翼中旗',
            '察哈尔右翼后旗',
            '四子王旗'
          ]
        },
        {
          name: '伊克昭盟',
          area: [
            '东胜市',
            '达拉特旗',
            '准格尔旗',
            '鄂托克前旗',
            '鄂托克旗',
            '杭锦旗',
            '乌审旗',
            '伊金霍洛旗'
          ]
        },
        {
          name: '巴彦淖尔盟',
          area: [
            '临河市',
            '五原县',
            '磴口县',
            '乌拉特前旗',
            '乌拉特中旗',
            '乌拉特后旗',
            '杭锦后旗'
          ]
        },
        {
          name: '阿拉善盟',
          area: ['阿拉善左旗', '阿拉善右旗', '额济纳旗']
        }
      ]
    },
    {
      name: '辽宁省',
      city: [
        {
          name: '沈阳市',
          area: [
            '沈河区',
            '皇姑区',
            '和平区',
            '大东区',
            '铁西区',
            '苏家屯区',
            '东陵区',
            '于洪区',
            '新民市',
            '法库县',
            '辽中县',
            '康平县',
            '新城子区',
            '其他'
          ]
        },
        {
          name: '大连市',
          area: [
            '西岗区',
            '中山区',
            '沙河口区',
            '甘井子区',
            '旅顺口区',
            '金州区',
            '瓦房店市',
            '普兰店市',
            '庄河市',
            '长海县',
            '其他'
          ]
        },
        {
          name: '鞍山市',
          area: [
            '铁东区',
            '铁西区',
            '立山区',
            '千山区',
            '海城市',
            '台安县',
            '岫岩满族自治县',
            '其他'
          ]
        },
        {
          name: '抚顺市',
          area: [
            '顺城区',
            '新抚区',
            '东洲区',
            '望花区',
            '抚顺县',
            '清原满族自治县',
            '新宾满族自治县',
            '其他'
          ]
        },
        {
          name: '本溪市',
          area: [
            '平山区',
            '明山区',
            '溪湖区',
            '南芬区',
            '本溪满族自治县',
            '桓仁满族自治县',
            '其他'
          ]
        },
        {
          name: '丹东市',
          area: [
            '振兴区',
            '元宝区',
            '振安区',
            '东港市',
            '凤城市',
            '宽甸满族自治县',
            '其他'
          ]
        },
        {
          name: '锦州市',
          area: [
            '太和区',
            '古塔区',
            '凌河区',
            '凌海市',
            '黑山县',
            '义县',
            '北宁市',
            '其他'
          ]
        },
        {
          name: '营口市',
          area: [
            '站前区',
            '西市区',
            '鲅鱼圈区',
            '老边区',
            '大石桥市',
            '盖州市',
            '其他'
          ]
        },
        {
          name: '阜新市',
          area: [
            '海州区',
            '新邱区',
            '太平区',
            '清河门区',
            '细河区',
            '彰武县',
            '阜新蒙古族自治县',
            '其他'
          ]
        },
        {
          name: '辽阳市',
          area: [
            '白塔区',
            '文圣区',
            '宏伟区',
            '太子河区',
            '弓长岭区',
            '灯塔市',
            '辽阳县',
            '其他'
          ]
        },
        {
          name: '盘锦',
          area: ['双台子区', '兴隆台区', '盘山县', '大洼县', '其他']
        },
        {
          name: '铁岭市',
          area: [
            '银州区',
            '清河区',
            '调兵山市',
            '开原市',
            '铁岭县',
            '昌图县',
            '西丰县',
            '其他'
          ]
        },
        {
          name: '朝阳市',
          area: [
            '双塔区',
            '龙城区',
            '凌源市',
            '北票市',
            '朝阳县',
            '建平县',
            '喀喇沁左翼蒙古族自治县',
            '其他'
          ]
        },
        {
          name: '葫芦岛市',
          area: [
            '龙港区',
            '南票区',
            '连山区',
            '兴城市',
            '绥中县',
            '建昌县',
            '其他'
          ]
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '云南省',
      city: [
        {
          name: '昆明市',
          area: [
            '盘龙区',
            '五华区',
            '官渡区',
            '西山区',
            '东川区',
            '安宁市',
            '呈贡县',
            '晋宁县',
            '富民县',
            '宜良县',
            '嵩明县',
            '石林彝族自治县',
            '禄劝彝族苗族自治县',
            '寻甸回族彝族自治县',
            '其他'
          ]
        },
        {
          name: '曲靖市',
          area: [
            '麒麟区',
            '宣威市',
            '马龙县',
            '沾益县',
            '富源县',
            '罗平县',
            '师宗县',
            '陆良县',
            '会泽县',
            '其他'
          ]
        },
        {
          name: '玉溪市',
          area: [
            '红塔区',
            '江川县',
            '澄江县',
            '通海县',
            '华宁县',
            '易门县',
            '峨山彝族自治县',
            '新平彝族傣族自治县',
            '元江哈尼族彝族傣族自治县',
            '其他'
          ]
        },
        {
          name: '保山市',
          area: ['隆阳区', '施甸县', '腾冲县', '龙陵县', '昌宁县', '其他']
        },
        {
          name: '昭通市',
          area: [
            '昭阳区',
            '鲁甸县',
            '巧家县',
            '盐津县',
            '大关县',
            '永善县',
            '绥江县',
            '镇雄县',
            '彝良县',
            '威信县',
            '水富县',
            '其他'
          ]
        },
        {
          name: '丽江市',
          area: [
            '古城区',
            '永胜县',
            '华坪县',
            '玉龙纳西族自治县',
            '宁蒗彝族自治县',
            '其他'
          ]
        },
        {
          name: '普洱市',
          area: [
            '思茅区',
            '普洱哈尼族彝族自治县',
            '墨江哈尼族自治县',
            '景东彝族自治县',
            '景谷傣族彝族自治县',
            '镇沅彝族哈尼族拉祜族自治县',
            '江城哈尼族彝族自治县',
            '孟连傣族拉祜族佤族自治县',
            '澜沧拉祜族自治县',
            '西盟佤族自治县',
            '其他'
          ]
        },
        {
          name: '临沧市',
          area: [
            '临翔区',
            '凤庆县',
            '云县',
            '永德县',
            '镇康县',
            '双江拉祜族佤族布朗族傣族自治县',
            '耿马傣族佤族自治县',
            '沧源佤族自治县',
            '其他'
          ]
        },
        {
          name: '德宏傣族景颇族自治州',
          area: ['潞西市', '瑞丽市', '梁河县', '盈江县', '陇川县', '其他']
        },
        {
          name: '怒江傈僳族自治州',
          area: [
            '泸水县',
            '福贡县',
            '贡山独龙族怒族自治县',
            '兰坪白族普米族自治县',
            '其他'
          ]
        },
        {
          name: '迪庆藏族自治州',
          area: ['香格里拉县', '德钦县', '维西傈僳族自治县', '其他']
        },
        {
          name: '大理白族自治州',
          area: [
            '大理市',
            '祥云县',
            '宾川县',
            '弥渡县',
            '永平县',
            '云龙县',
            '洱源县',
            '剑川县',
            '鹤庆县',
            '漾濞彝族自治县',
            '南涧彝族自治县',
            '巍山彝族回族自治县',
            '其他'
          ]
        },
        {
          name: '楚雄彝族自治州',
          area: [
            '楚雄市',
            '双柏县',
            '牟定县',
            '南华县',
            '姚安县',
            '大姚县',
            '永仁县',
            '元谋县',
            '武定县',
            '禄丰县',
            '其他'
          ]
        },
        {
          name: '红河哈尼族彝族自治州',
          area: [
            '蒙自县',
            '个旧市',
            '开远市',
            '绿春县',
            '建水县',
            '石屏县',
            '弥勒县',
            '泸西县',
            '元阳县',
            '红河县',
            '金平苗族瑶族傣族自治县',
            '河口瑶族自治县',
            '屏边苗族自治县',
            '其他'
          ]
        },
        {
          name: '文山壮族苗族自治州',
          area: [
            '文山县',
            '砚山县',
            '西畴县',
            '麻栗坡县',
            '马关县',
            '丘北县',
            '广南县',
            '富宁县',
            '其他'
          ]
        },
        {
          name: '西双版纳傣族自治州',
          area: ['景洪市', '勐海县', '勐腊县', '其他']
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '西藏',
      city: [
        {
          name: '拉萨市',
          area: [
            '城关区',
            '林周县',
            '当雄县',
            '尼木县',
            '曲水县',
            '堆龙德庆县',
            '达孜县',
            '墨竹工卡县',
            '其他'
          ]
        },
        {
          name: '那曲地区',
          area: [
            '那曲县',
            '嘉黎县',
            '比如县',
            '聂荣县',
            '安多县',
            '申扎县',
            '索县',
            '班戈县',
            '巴青县',
            '尼玛县',
            '其他'
          ]
        },
        {
          name: '昌都地区',
          area: [
            '昌都县',
            '江达县',
            '贡觉县',
            '类乌齐县',
            '丁青县',
            '察雅县',
            '八宿县',
            '左贡县',
            '芒康县',
            '洛隆县',
            '边坝县',
            '其他'
          ]
        },
        {
          name: '林芝地区',
          area: [
            '林芝县',
            '工布江达县',
            '米林县',
            '墨脱县',
            '波密县',
            '察隅县',
            '朗县',
            '其他'
          ]
        },
        {
          name: '山南地区',
          area: [
            '乃东县',
            '扎囊县',
            '贡嘎县',
            '桑日县',
            '琼结县',
            '曲松县',
            '措美县',
            '洛扎县',
            '加查县',
            '隆子县',
            '错那县',
            '浪卡子县',
            '其他'
          ]
        },
        {
          name: '日喀则地区',
          area: [
            '日喀则市',
            '南木林县',
            '江孜县',
            '定日县',
            '萨迦县',
            '拉孜县',
            '昂仁县',
            '谢通门县',
            '白朗县',
            '仁布县',
            '康马县',
            '定结县',
            '仲巴县',
            '亚东县',
            '吉隆县',
            '聂拉木县',
            '萨嘎县',
            '岗巴县',
            '其他'
          ]
        },
        {
          name: '阿里地区',
          area: [
            '噶尔县',
            '普兰县',
            '札达县',
            '日土县',
            '革吉县',
            '改则县',
            '措勤县',
            '其他'
          ]
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '陕西省',
      city: [
        {
          name: '西安市',
          area: [
            '莲湖区',
            '新城区',
            '碑林区',
            '雁塔区',
            '灞桥区',
            '未央区',
            '阎良区',
            '临潼区',
            '长安区',
            '高陵县',
            '蓝田县',
            '户县',
            '周至县',
            '其他'
          ]
        },
        {
          name: '铜川市',
          area: ['耀州区', '王益区', '印台区', '宜君县', '其他']
        },
        {
          name: '宝鸡市',
          area: [
            '渭滨区',
            '金台区',
            '陈仓区',
            '岐山县',
            '凤翔县',
            '陇县',
            '太白县',
            '麟游县',
            '扶风县',
            '千阳县',
            '眉县',
            '凤县',
            '其他'
          ]
        },
        {
          name: '咸阳市',
          area: [
            '秦都区',
            '渭城区',
            '杨陵区',
            '兴平市',
            '礼泉县',
            '泾阳县',
            '永寿县',
            '三原县',
            '彬县',
            '旬邑县',
            '长武县',
            '乾县',
            '武功县',
            '淳化县',
            '其他'
          ]
        },
        {
          name: '渭南市',
          area: [
            '临渭区',
            '韩城市',
            '华阴市',
            '蒲城县',
            '潼关县',
            '白水县',
            '澄城县',
            '华县',
            '合阳县',
            '富平县',
            '大荔县',
            '其他'
          ]
        },
        {
          name: '延安市',
          area: [
            '宝塔区',
            '安塞县',
            '洛川县',
            '子长县',
            '黄陵县',
            '延川县',
            '富县',
            '延长县',
            '甘泉县',
            '宜川县',
            '志丹县',
            '黄龙县',
            '吴起县',
            '其他'
          ]
        },
        {
          name: '汉中市',
          area: [
            '汉台区',
            '留坝县',
            '镇巴县',
            '城固县',
            '南郑县',
            '洋县',
            '宁强县',
            '佛坪县',
            '勉县',
            '西乡县',
            '略阳县',
            '其他'
          ]
        },
        {
          name: '榆林市',
          area: [
            '榆阳区',
            '清涧县',
            '绥德县',
            '神木县',
            '佳县',
            '府谷县',
            '子洲县',
            '靖边县',
            '横山县',
            '米脂县',
            '吴堡县',
            '定边县',
            '其他'
          ]
        },
        {
          name: '安康市',
          area: [
            '汉滨区',
            '紫阳县',
            '岚皋县',
            '旬阳县',
            '镇坪县',
            '平利县',
            '石泉县',
            '宁陕县',
            '白河县',
            '汉阴县',
            '其他'
          ]
        },
        {
          name: '商洛市',
          area: [
            '商州区',
            '镇安县',
            '山阳县',
            '洛南县',
            '商南县',
            '丹凤县',
            '柞水县',
            '其他'
          ]
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '甘肃省',
      city: [
        {
          name: '兰州市',
          area: [
            '城关区',
            '七里河区',
            '西固区',
            '安宁区',
            '红古区',
            '永登县',
            '皋兰县',
            '榆中县',
            '其他'
          ]
        },
        {
          name: '嘉峪关市',
          area: ['嘉峪关市', '其他']
        },
        {
          name: '金昌市',
          area: ['金川区', '永昌县', '其他']
        },
        {
          name: '白银市',
          area: ['白银区', '平川区', '靖远县', '会宁县', '景泰县', '其他']
        },
        {
          name: '天水市',
          area: [
            '清水县',
            '秦安县',
            '甘谷县',
            '武山县',
            '张家川回族自治县',
            '北道区',
            '秦城区',
            '其他'
          ]
        },
        {
          name: '武威市',
          area: ['凉州区', '民勤县', '古浪县', '天祝藏族自治县', '其他']
        },
        {
          name: '酒泉市',
          area: [
            '肃州区',
            '玉门市',
            '敦煌市',
            '金塔县',
            '肃北蒙古族自治县',
            '阿克塞哈萨克族自治县',
            '安西县',
            '其他'
          ]
        },
        {
          name: '张掖市',
          area: [
            '甘州区',
            '民乐县',
            '临泽县',
            '高台县',
            '山丹县',
            '肃南裕固族自治县',
            '其他'
          ]
        },
        {
          name: '庆阳市',
          area: [
            '西峰区',
            '庆城县',
            '环县',
            '华池县',
            '合水县',
            '正宁县',
            '宁县',
            '镇原县',
            '其他'
          ]
        },
        {
          name: '平凉市',
          area: [
            '崆峒区',
            '泾川县',
            '灵台县',
            '崇信县',
            '华亭县',
            '庄浪县',
            '静宁县',
            '其他'
          ]
        },
        {
          name: '定西市',
          area: [
            '安定区',
            '通渭县',
            '临洮县',
            '漳县',
            '岷县',
            '渭源县',
            '陇西县',
            '其他'
          ]
        },
        {
          name: '陇南市',
          area: [
            '武都区',
            '成县',
            '宕昌县',
            '康县',
            '文县',
            '西和县',
            '礼县',
            '两当县',
            '徽县',
            '其他'
          ]
        },
        {
          name: '临夏回族自治州',
          area: [
            '临夏市',
            '临夏县',
            '康乐县',
            '永靖县',
            '广河县',
            '和政县',
            '东乡族自治县',
            '积石山保安族东乡族撒拉族自治县',
            '其他'
          ]
        },
        {
          name: '甘南藏族自治州',
          area: [
            '合作市',
            '临潭县',
            '卓尼县',
            '舟曲县',
            '迭部县',
            '玛曲县',
            '碌曲县',
            '夏河县',
            '其他'
          ]
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '青海省',
      city: [
        {
          name: '西宁市',
          area: [
            '城中区',
            '城东区',
            '城西区',
            '城北区',
            '湟源县',
            '湟中县',
            '大通回族土族自治县',
            '其他'
          ]
        },
        {
          name: '海东地区',
          area: [
            '平安县',
            '乐都县',
            '民和回族土族自治县',
            '互助土族自治县',
            '化隆回族自治县',
            '循化撒拉族自治县',
            '其他'
          ]
        },
        {
          name: '海北藏族自治州',
          area: ['海晏县', '祁连县', '刚察县', '门源回族自治县', '其他']
        },
        {
          name: '海南藏族自治州',
          area: ['共和县', '同德县', '贵德县', '兴海县', '贵南县', '其他']
        },
        {
          name: '黄南藏族自治州',
          area: ['同仁县', '尖扎县', '泽库县', '河南蒙古族自治县', '其他']
        },
        {
          name: '果洛藏族自治州',
          area: [
            '玛沁县',
            '班玛县',
            '甘德县',
            '达日县',
            '久治县',
            '玛多县',
            '其他'
          ]
        },
        {
          name: '玉树藏族自治州',
          area: [
            '玉树县',
            '杂多县',
            '称多县',
            '治多县',
            '囊谦县',
            '曲麻莱县',
            '其他'
          ]
        },
        {
          name: '海西蒙古族藏族自治州',
          area: ['德令哈市', '格尔木市', '乌兰县', '都兰县', '天峻县', '其他']
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '宁夏',
      city: [
        {
          name: '银川市',
          area: [
            '兴庆区',
            '西夏区',
            '金凤区',
            '灵武市',
            '永宁县',
            '贺兰县',
            '其他'
          ]
        },
        {
          name: '石嘴山市',
          area: ['大武口区', '惠农区', '平罗县', '其他']
        },
        {
          name: '吴忠市',
          area: ['利通区', '青铜峡市', '盐池县', '同心县', '其他']
        },
        {
          name: '固原市',
          area: ['原州区', '西吉县', '隆德县', '泾源县', '彭阳县', '其他']
        },
        {
          name: '中卫市',
          area: ['沙坡头区', '中宁县', '海原县', '其他']
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '新疆',
      city: [
        {
          name: '乌鲁木齐市',
          area: [
            '天山区',
            '沙依巴克区',
            '新市区',
            '水磨沟区',
            '头屯河区',
            '达坂城区',
            '东山区',
            '乌鲁木齐县',
            '其他'
          ]
        },
        {
          name: '克拉玛依市',
          area: ['克拉玛依区', '独山子区', '白碱滩区', '乌尔禾区', '其他']
        },
        {
          name: '吐鲁番地区',
          area: ['吐鲁番市', '托克逊县', '鄯善县', '其他']
        },
        {
          name: '哈密地区',
          area: ['哈密市', '伊吾县', '巴里坤哈萨克自治县', '其他']
        },
        {
          name: '和田地区',
          area: [
            '和田市',
            '和田县',
            '洛浦县',
            '民丰县',
            '皮山县',
            '策勒县',
            '于田县',
            '墨玉县',
            '其他'
          ]
        },
        {
          name: '阿克苏地区',
          area: [
            '阿克苏市',
            '温宿县',
            '沙雅县',
            '拜城县',
            '阿瓦提县',
            '库车县',
            '柯坪县',
            '新和县',
            '乌什县',
            '其他'
          ]
        },
        {
          name: '喀什地区',
          area: [
            '喀什市',
            '巴楚县',
            '泽普县',
            '伽师县',
            '叶城县',
            '岳普湖县',
            '疏勒县',
            '麦盖提县',
            '英吉沙县',
            '莎车县',
            '疏附县',
            '塔什库尔干塔吉克自治县',
            '其他'
          ]
        },
        {
          name: '克孜勒苏柯尔克孜自治州',
          area: ['阿图什市', '阿合奇县', '乌恰县', '阿克陶县', '其他']
        },
        {
          name: '巴音郭楞蒙古自治州',
          area: [
            '库尔勒市',
            '和静县',
            '尉犁县',
            '和硕县',
            '且末县',
            '博湖县',
            '轮台县',
            '若羌县',
            '焉耆回族自治县',
            '其他'
          ]
        },
        {
          name: '昌吉回族自治州',
          area: [
            '昌吉市',
            '阜康市',
            '奇台县',
            '玛纳斯县',
            '吉木萨尔县',
            '呼图壁县',
            '木垒哈萨克自治县',
            '米泉市',
            '其他'
          ]
        },
        {
          name: '博尔塔拉蒙古自治州',
          area: ['博乐市', '精河县', '温泉县', '其他']
        },
        {
          name: '石河子',
          area: ['石河子']
        },
        {
          name: '阿拉尔',
          area: ['阿拉尔']
        },
        {
          name: '图木舒克',
          area: ['图木舒克']
        },
        {
          name: '五家渠',
          area: ['五家渠']
        },
        {
          name: '伊犁哈萨克自治州',
          area: [
            '伊宁市',
            '奎屯市',
            '伊宁县',
            '特克斯县',
            '尼勒克县',
            '昭苏县',
            '新源县',
            '霍城县',
            '巩留县',
            '察布查尔锡伯自治县',
            '塔城地区',
            '阿勒泰地区',
            '其他'
          ]
        },
        {
          name: '其他',
          area: ['其他']
        }
      ]
    },
    {
      name: '台湾省',
      city: [
        {
          name: '台北市',
          area: [
            '内湖区',
            '南港区',
            '中正区',
            '万华区',
            '大同区',
            '中山区',
            '松山区',
            '大安区',
            '信义区',
            '文山区',
            '士林区',
            '北投区'
          ]
        },
        {
          name: '新北市',
          area: ['板桥区', '汐止区', '新店区', '其他']
        },
        {
          name: '桃园市',
          area: ['其他']
        },
        {
          name: '台中市',
          area: ['其他']
        },
        {
          name: '台南市',
          area: ['其他']
        },
        {
          name: '高雄市',
          area: ['其他']
        }
      ]
    },
    {
      name: '澳门',
      city: [
        {
          name: '澳门',
          area: [
            '花地玛堂区',
            '圣安多尼堂区',
            '大堂区',
            '望德堂区',
            '风顺堂区',
            '嘉模堂区',
            '圣方济各堂区',
            '路凼',
            '其他'
          ]
        }
      ]
    },
    {
      name: '香港',
      city: [
        {
          name: '香港',
          area: [
            '深水埗区',
            '油尖旺区',
            '九龙城区',
            '黄大仙区',
            '观塘区',
            '北区',
            '大埔区',
            '沙田区',
            '西贡区',
            '元朗区',
            '屯门区',
            '荃湾区',
            '葵青区',
            '离岛区',
            '中西区',
            '湾仔区',
            '东区',
            '南区',
            '其他'
          ]
        }
      ]
    }
  ];
}
